<template>
          <div class="faq section">
          <div class="container"> 
            <div class="faq-head section-title">
              <div class="faq-head__title-1">Часто задаваемые вопросы</div>
              <div class="faq-head__title-2 f-script">FAQ</div>
            </div>
            <div class="faq-list"> 
                <FaqItem
                v-for="(item, index) in faqList" :key="index"
                :title="item.title"
                :answer="item.answer"
                />
            </div>
          </div>
        </div>
</template>

<script>
import FaqItem from './FaqItem.vue'
export default {
    components: {
        FaqItem
    },
    setup(props) {
        const faqList = [
            {
                id: 1,
                title: 'Как сделать заказ?',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            {
                id: 2,
                title: 'Способы оплаты',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            {
                id: 3,
                title: 'Доставка',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            {
                id: 4,
                title: 'Сроки доставки',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            {
                id: 5,
                title: 'Как сделать обмен?',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            {
                id: 6,
                title: 'Как сделать возврат?',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            {
                id: 7,
                title: 'Куда и когда вернутся деньги за возвращённый товар?',
                answer: 'Чтобы сделать заказ пользователь переходит в каталог сайта, выбирает нужный товар, отпраляет его в коризину, выбрав нужный размер и цвет, и нажимает кнопку “заказать”. Выбирает способ оплаты и доставки и покупает товар.'
            },
            
        ]

        return {
            faqList
        }
    }

}
</script>

